questions about AirCreateReservationRsp, req code

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <ns3:AirCreateReservationReq xmlns="http://www.travelport.com/schema/common_v42_0" xmlns:ns2="http://www.travelport.com/schema/air_v42_0" xmlns:ns3="http://www.travelport.com/schema/universal_v42_0" xmlns:ns4="http://www.travelport.com/schema/cruise_v42_0" xmlns:ns5="http://www.travelport.com/schema/rail_v42_0" xmlns:ns6="http://www.travelport.com/schema/vehicle_v42_0" xmlns:ns7="http://www.travelport.com/schema/hotel_v42_0" xmlns:ns8="http://www.travelport.com/schema/passive_v42_0" xmlns:ns9="http://www.travelport.com/soa/common/security/SessionContext_v1" TraceId="b32254f4-c509-43e4-ac59-ba15ec076ad7" TargetBranch="P7085271">
            <BillingPointOfSaleInfo OriginApplication="UAPI"/>
            <BookingTraveler Key="JYFhVYdiQtmFe0kjiNtwaw==" TravelerType="ADT" DOB="1967-11-23" Gender="M">
                <BookingTravelerName Prefix="Mr" First="Jack" Last="Smith"/>
                <PhoneNumber Location="DEN" CountryCode="1" AreaCode="303" Number="3333333"/>
            </BookingTraveler>
            <FormOfPayment Key="1" Type="Check">
                <Check RoutingNumber="456" AccountNumber="7890" CheckNumber="1234567"/>
            </FormOfPayment>
            <ns2:AirPricingSolution Key="uIgDb63R2BKAJbFdBAAAAA==" QuoteDate="2017-09-22" TotalPrice="EUR766.59" BasePrice="CNY2640" ApproximateTotalPrice="EUR766.59" ApproximateBasePrice="EUR334.00" EquivalentBasePrice="EUR334.00" Taxes="EUR432.59" Fees="EUR0.00" ApproximateTaxes="EUR432.59">
                <ns2:AirSegment Group="0" Carrier="AF" FlightNumber="117" ClassOfService="N" ChangeOfPlane="false" OptionalServicesIndicator="false" FlightTime="765" TravelTime="765" Distance="5746" ProviderCode="1G" Origin="PVG" Destination="CDG" DepartureTime="2017-11-21T11:00:00.000+08:00" ArrivalTime="2017-11-21T16:45:00.000+01:00" AvailabilityDisplayType="Fare Specific Fare Quote Unbooked" Key="uIgDb63R2BKABbFdBAAAAA==">
                    <ns2:CodeshareInfo OperatingCarrier="AF">Air France</ns2:CodeshareInfo>
                </ns2:AirSegment>
                <ns2:AirSegment Group="0" Carrier="AF" FlightNumber="1118" ClassOfService="L" ChangeOfPlane="false" OptionalServicesIndicator="false" FlightTime="85" TravelTime="85" Distance="275" ProviderCode="1G" Origin="CDG" Destination="FRA" DepartureTime="2017-11-21T17:50:00.000+01:00" ArrivalTime="2017-11-21T19:15:00.000+01:00" AvailabilityDisplayType="Fare Specific Fare Quote Unbooked" Key="uIgDb63R2BKADbFdBAAAAA==">
                    <ns2:CodeshareInfo OperatingCarrier="AF">Air France</ns2:CodeshareInfo>
                </ns2:AirSegment>
                <ns2:AirSegment Group="1" Carrier="CZ" FlightNumber="7626" ClassOfService="V" ChangeOfPlane="false" OptionalServicesIndicator="false" FlightTime="80" TravelTime="80" Distance="228" ProviderCode="1G" Origin="FRA" Destination="AMS" DepartureTime="2017-11-29T10:15:00.000+01:00" ArrivalTime="2017-11-29T11:35:00.000+01:00" AvailabilityDisplayType="Fare Specific Fare Quote Unbooked" Key="uIgDb63R2BKAFbFdBAAAAA==">
                    <ns2:CodeshareInfo OperatingCarrier="KL">KLM Royal Dutch Airlines</ns2:CodeshareInfo>
                </ns2:AirSegment>
                <ns2:AirSegment Group="1" Carrier="CZ" FlightNumber="770" ClassOfService="V" ChangeOfPlane="false" OptionalServicesIndicator="false" FlightTime="635" TravelTime="635" Distance="5527" ProviderCode="1G" Origin="AMS" Destination="PVG" DepartureTime="2017-11-29T17:15:00.000+01:00" ArrivalTime="2017-11-30T10:50:00.000+08:00" AvailabilityDisplayType="Fare Specific Fare Quote Unbooked" Key="uIgDb63R2BKAHbFdBAAAAA==">
                    <ns2:CodeshareInfo OperatingCarrier="KL">KLM Royal Dutch Airlines</ns2:CodeshareInfo>
                </ns2:AirSegment>
                <ns2:AirPricingInfo Key="uIgDb63R2BKAMbFdBAAAAA==" IncludesVAT="false" LatestTicketingTime="2017-09-25T23:59:00.000+02:00" PricingMethod="Auto" ETicketability="Yes" PlatingCarrier="CZ" TotalPrice="EUR766.59" BasePrice="CNY2640" ApproximateTotalPrice="EUR766.59" ApproximateBasePrice="EUR334.00" EquivalentBasePrice="EUR334.00" Taxes="EUR432.59" ApproximateTaxes="EUR432.59" ProviderCode="1G">
                    <ns2:FareInfo Key="uIgDb63R2BKAXbFdBAAAAA==" FareBasis="NLXSRCN" PassengerTypeCode="ADT" Origin="PVG" Destination="FRA" EffectiveDate="2017-09-22T14:36:00.000+02:00" DepartureDate="2017-11-21" Amount="EUR158.00" NotValidBefore="2017-11-21" NotValidAfter="2017-11-21" TaxAmount="EUR188.40">
                        <Endorsement Value="NON END/NON REF"/>
                        <Endorsement Value="Q/NONEND PENALTY APPLS"/>
                        <ns2:FareRuleKey FareInfoRef="uIgDb63R2BKAXbFdBAAAAA==" ProviderCode="1G">6UUVoSldxwj4xlra3oitIsbKj3F8T9EyxsqPcXxP0TIjSPOlaHfQe5cuasWd6i8Dly5qxZ3qLwOXLmrFneovA5cuasWd6i8Dly5qxZ3qLwOXLmrFneovAzaS4FZstd3pM3ExqSoG050+d2zHu5l8fT1WoNyoSU20Qu0ZscBMSQ48jz0eOjNW7UB9waJ27cKhYibrzK0Ouv3MN4B6NiLACBll6FxyIC6cYuAWfcH2w92IEQfz1U0L746AZzJf/zcoGSVM2cBk+s3qkp0FEw0raOCbZ1nsUQQBPS2yoZzCwZI8jVJCfg+7TIuFsAExMoVlv4Xvb2u1Qx+/he9va7VDH7+F729rtUMfv4Xvb2u1Qx+/he9va7VDHzyxauAs+veBE308BFXsd7QPNqcmmS6r7B2WN4EjYakq9B7DTew/pWBmFcHyqq12fNYDyiqi7YNK5GwF8kqQiiA=</ns2:FareRuleKey>
                        <ns2:Brand Key="uIgDb63R2BKAXbFdBAAAAA==" BrandFound="false" UpSellBrandFound="false"/>
                    </ns2:FareInfo>
                    <ns2:FareInfo Key="uIgDb63R2BKAabFdBAAAAA==" FareBasis="V2NNCQE" PassengerTypeCode="ADT" Origin="FRA" Destination="PVG" EffectiveDate="2017-09-22T14:36:00.000+02:00" DepartureDate="2017-11-29" Amount="EUR176.00" NotValidBefore="2017-11-29" NotValidAfter="2017-11-29" TaxAmount="EUR244.19">
                        <Endorsement Value="NON END/NON REF"/>
                        <Endorsement Value="Q/NONEND PENALTY APPLS"/>
                        <ns2:FareRuleKey FareInfoRef="uIgDb63R2BKAabFdBAAAAA==" ProviderCode="1G">6UUVoSldxwj4xlra3oitIsbKj3F8T9EyxsqPcXxP0TIjSPOlaHfQe5cuasWd6i8Dly5qxZ3qLwOXLmrFneovA5cuasWd6i8Dly5qxZ3qLwOXLmrFneovA1m5Ou4LJZupM3ExqSoG0500hrapkRVeaulSYR0r6oiA83f1UwCbb2U8jz0eOjNW7dMR4EKycdYvYibrzK0Ouv19A6LRWcxdZRll6FxyIC6cYuAWfcH2w92IEQfz1U0L746AZzJf/zcof7J5HnV/r73vWpSmZkrE0eCbZ1nsUQQBBU5bGMVhZgI0UWX6vLFGDouFsAExMoVlv4Xvb2u1Qx+/he9va7VDH7+F729rtUMfv4Xvb2u1Qx+/he9va7VDHzyxauAs+veBE308BFXsd7QPNqcmmS6r7B2WN4EjYakqbTN6dhTiIeak3kr9yvdnFTRr+iuA5C+IKAxevs8wf8A=</ns2:FareRuleKey>
                    </ns2:FareInfo>
                    <ns2:BookingInfo BookingCode="N" CabinClass="Economy" FareInfoRef="uIgDb63R2BKAXbFdBAAAAA==" SegmentRef="uIgDb63R2BKABbFdBAAAAA==" HostTokenRef="uIgDb63R2BKAKbFdBAAAAA=="/>
                    <ns2:BookingInfo BookingCode="L" CabinClass="Economy" FareInfoRef="uIgDb63R2BKAXbFdBAAAAA==" SegmentRef="uIgDb63R2BKADbFdBAAAAA==" HostTokenRef="uIgDb63R2BKAKbFdBAAAAA=="/>
                    <ns2:BookingInfo BookingCode="V" CabinClass="Economy" FareInfoRef="uIgDb63R2BKAabFdBAAAAA==" SegmentRef="uIgDb63R2BKAFbFdBAAAAA==" HostTokenRef="uIgDb63R2BKALbFdBAAAAA=="/>
                    <ns2:BookingInfo BookingCode="V" CabinClass="Economy" FareInfoRef="uIgDb63R2BKAabFdBAAAAA==" SegmentRef="uIgDb63R2BKAHbFdBAAAAA==" HostTokenRef="uIgDb63R2BKALbFdBAAAAA=="/>
                    <ns2:TaxInfo Key="uIgDb63R2BKANbFdBAAAAA==" Category="DE" Amount="EUR9.56"/>
                    <ns2:TaxInfo Key="uIgDb63R2BKAObFdBAAAAA==" Category="OY" Amount="EUR41.99"/>
                    <ns2:TaxInfo Key="uIgDb63R2BKAPbFdBAAAAA==" Category="RA" Amount="EUR26.61"/>
                    <ns2:TaxInfo Key="uIgDb63R2BKAQbFdBAAAAA==" Category="CN" Amount="EUR11.38"/>
                    <ns2:TaxInfo Key="uIgDb63R2BKARbFdBAAAAA==" Category="FR" Amount="EUR8.15"/>
                    <ns2:TaxInfo Key="uIgDb63R2BKASbFdBAAAAA==" Category="QX" Amount="EUR10.44"/>
                    <ns2:TaxInfo Key="uIgDb63R2BKATbFdBAAAAA==" Category="CJ" Amount="EUR5.64"/>
                    <ns2:TaxInfo Key="uIgDb63R2BKAUbFdBAAAAA==" Category="RN" Amount="EUR5.36"/>
                    <ns2:TaxInfo Key="uIgDb63R2BKAVbFdBAAAAA==" Category="YQ" Amount="EUR10.20"/>
                    <ns2:TaxInfo Key="uIgDb63R2BKAWbFdBAAAAA==" Category="YR" Amount="EUR303.26"/>
                    <ns2:FareCalc>SHA AF X/PAR AF FRA 183.86NLXSRCN CZ X/AMS CZ SHA 204.45V2NNCQE NUC388.31END ROE6.79852</ns2:FareCalc>
                    <ns2:PassengerType Code="ADT"/>
                    <ns2:ChangePenalty>
                        <ns2:Amount>EUR101.00</ns2:Amount>
                    </ns2:ChangePenalty>
                    <ns2:BaggageAllowances>
                        <ns2:BaggageAllowanceInfo TravelerType="ADT" Origin="SHA" Destination="FRA" Carrier="AF">
                            <ns2:URLInfo>
                                <ns2:URL>MYTRIPANDMORE.COM/BAGGAGEDETAILSAF.BAGG</ns2:URL>
                            </ns2:URLInfo>
                            <ns2:TextInfo>
                                <ns2:Text>1P</ns2:Text>
                                <ns2:Text>BAGGAGE DISCOUNTS MAY APPLY BASED ON FREQUENT FLYER STATUS/ ONLINE CHECKIN/FORM OF PAYMENT/MILITARY/ETC.</ns2:Text>
                            </ns2:TextInfo>
                            <ns2:BagDetails ApplicableBags="1stChecked" BasePrice="CNY0" ApproximateBasePrice="EUR0.00" TotalPrice="CNY0" ApproximateTotalPrice="EUR0.00">
                                <ns2:BaggageRestriction>
                                    <ns2:TextInfo>
                                        <ns2:Text>UPTO50LB/23KG AND UPTO62LI/158LCM</ns2:Text>
                                    </ns2:TextInfo>
                                </ns2:BaggageRestriction>
                            </ns2:BagDetails>
                            <ns2:BagDetails ApplicableBags="2ndChecked" BasePrice="CNY680" ApproximateBasePrice="EUR85.92" TotalPrice="CNY680" ApproximateTotalPrice="EUR85.92">
                                <ns2:BaggageRestriction>
                                    <ns2:TextInfo>
                                        <ns2:Text>UPTO50LB/23KG AND UPTO62LI/158LCM</ns2:Text>
                                    </ns2:TextInfo>
                                </ns2:BaggageRestriction>
                            </ns2:BagDetails>
                        </ns2:BaggageAllowanceInfo>
                        <ns2:BaggageAllowanceInfo TravelerType="ADT" Origin="FRA" Destination="SHA" Carrier="KL">
                            <ns2:URLInfo>
                                <ns2:URL>MYTRIPANDMORE.COM/BAGGAGEDETAILSKL.BAGG</ns2:URL>
                            </ns2:URLInfo>
                            <ns2:TextInfo>
                                <ns2:Text>1P</ns2:Text>
                                <ns2:Text>BAGGAGE DISCOUNTS MAY APPLY BASED ON FREQUENT FLYER STATUS/ ONLINE CHECKIN/FORM OF PAYMENT/MILITARY/ETC.</ns2:Text>
                            </ns2:TextInfo>
                            <ns2:BagDetails ApplicableBags="1stChecked" BasePrice="CNY0" ApproximateBasePrice="EUR0.00" TotalPrice="CNY0" ApproximateTotalPrice="EUR0.00">
                                <ns2:BaggageRestriction>
                                    <ns2:TextInfo>
                                        <ns2:Text>UPTO50LB/23KG AND UPTO62LI/158LCM</ns2:Text>
                                    </ns2:TextInfo>
                                </ns2:BaggageRestriction>
                            </ns2:BagDetails>
                            <ns2:BagDetails ApplicableBags="2ndChecked" BasePrice="EUR100.00" ApproximateBasePrice="EUR100.00" TotalPrice="EUR100.00" ApproximateTotalPrice="EUR100.00">
                                <ns2:BaggageRestriction>
                                    <ns2:TextInfo>
                                        <ns2:Text>UPTO50LB/23KG AND UPTO62LI/158LCM</ns2:Text>
                                    </ns2:TextInfo>
                                </ns2:BaggageRestriction>
                            </ns2:BagDetails>
                        </ns2:BaggageAllowanceInfo>
                        <ns2:CarryOnAllowanceInfo Origin="SHA" Destination="PAR" Carrier="AF">
                            <ns2:TextInfo>
                                <ns2:Text>1P</ns2:Text>
                            </ns2:TextInfo>
                            <ns2:CarryOnDetails ApplicableCarryOnBags="1" BasePrice="CNY0" ApproximateBasePrice="EUR0.00" TotalPrice="CNY0" ApproximateTotalPrice="EUR0.00">
                                <ns2:BaggageRestriction>
                                    <ns2:TextInfo>
                                        <ns2:Text>UPTO26LB/12KG AND UPTO45LI/115LCM</ns2:Text>
                                    </ns2:TextInfo>
                                </ns2:BaggageRestriction>
                            </ns2:CarryOnDetails>
                        </ns2:CarryOnAllowanceInfo>
                        <ns2:CarryOnAllowanceInfo Origin="PAR" Destination="FRA" Carrier="AF">
                            <ns2:TextInfo>
                                <ns2:Text>1P</ns2:Text>
                            </ns2:TextInfo>
                            <ns2:CarryOnDetails ApplicableCarryOnBags="1" BasePrice="EUR0.00" ApproximateBasePrice="EUR0.00" TotalPrice="EUR0.00" ApproximateTotalPrice="EUR0.00">
                                <ns2:BaggageRestriction>
                                    <ns2:TextInfo>
                                        <ns2:Text>UPTO26LB/12KG AND UPTO45LI/115LCM</ns2:Text>
                                    </ns2:TextInfo>
                                </ns2:BaggageRestriction>
                            </ns2:CarryOnDetails>
                        </ns2:CarryOnAllowanceInfo>
                        <ns2:CarryOnAllowanceInfo Origin="FRA" Destination="AMS" Carrier="KL">
                            <ns2:TextInfo>
                                <ns2:Text>1P</ns2:Text>
                            </ns2:TextInfo>
                            <ns2:CarryOnDetails ApplicableCarryOnBags="1" BasePrice="EUR0.00" ApproximateBasePrice="EUR0.00" TotalPrice="EUR0.00" ApproximateTotalPrice="EUR0.00">
                                <ns2:BaggageRestriction>
                                    <ns2:TextInfo>
                                        <ns2:Text>UPTO26LB/12KG AND UPTO45LI/115LCM</ns2:Text>
                                    </ns2:TextInfo>
                                </ns2:BaggageRestriction>
                            </ns2:CarryOnDetails>
                        </ns2:CarryOnAllowanceInfo>
                        <ns2:CarryOnAllowanceInfo Origin="AMS" Destination="SHA" Carrier="KL">
                            <ns2:TextInfo>
                                <ns2:Text>1P</ns2:Text>
                            </ns2:TextInfo>
                            <ns2:CarryOnDetails ApplicableCarryOnBags="1" BasePrice="EUR0.00" ApproximateBasePrice="EUR0.00" TotalPrice="EUR0.00" ApproximateTotalPrice="EUR0.00">
                                <ns2:BaggageRestriction>
                                    <ns2:TextInfo>
                                        <ns2:Text>UPTO26LB/12KG AND UPTO45LI/115LCM</ns2:Text>
                                    </ns2:TextInfo>
                                </ns2:BaggageRestriction>
                            </ns2:CarryOnDetails>
                        </ns2:CarryOnAllowanceInfo>
                    </ns2:BaggageAllowances>
                </ns2:AirPricingInfo>
                <HostToken Key="uIgDb63R2BKAKbFdBAAAAA==">GFB10101ADT00 01NLXSRCN 0200010002#GFB200010101NADTV3004CNSR0010000199#</HostToken>
                <HostToken Key="uIgDb63R2BKALbFdBAAAAA==">GFB10101ADT00 02V2NNCQE 0200030004#GFB200010102NADTV3004CN1400100007990016I#</HostToken>
            </ns2:AirPricingSolution>
            <ActionStatus Type="ACTIVE" TicketDate="T*" ProviderCode="1G"/>
            <Payment Key="1" Type="Itinerary" FormOfPaymentRef="1" Amount="500"/>
        </ns3:AirCreateReservationReq>
    </soap:Body>
</soap:Envelope>
